---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
source: html/004fe9d1-0b32-4ed3-b8c6-42e0ae00a5a3.htm
---
# ExtensibleStorageFilter Members

Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.